.LIST
;############################################################################
;       Function : DAT_READ
;	读出数据
;
;	input  : no
;	OUTPUT : ACCH = 0/1 ===> 无效/有效
;		 SYSTEMP0 = 读出的结果 
;	
;
;############################################################################
DAT_READ:
	ANDL	0X0FF
	BS	ACZ,DAT_READ_END

	ORL	0XE200		;1 byte
       	CALL    DAM_BIOSFUNC
       	SAH	SYSTMP0
       	SFR     8
       	BZ      ACZ,DAT_READ_END

	LACK	1	;读出结果有效
	RET
DAT_READ_END:
	CALL	DAT_READ_STOP

       	LACK	0	;读出结果无效
;-----------------------------------------	
	RET
;############################################################################
;       Function : STOPTELNUM_READ
;	停止从当前Group读出电话号码
;
;	input  : no
;	OUTPUT : no
;############################################################################
DAT_READ_STOP:
       	LACL	0XE300
       	CALL    DAM_BIOSFUNC

	RET

;-------------------------------------------------------------------------------
;-------------------------------------------------------------------------------
.END
